tutorials/multiPhysics/interTrackEddyCurrentFoam/rgsSimpleBlock3D/constant/region_fluid/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh               dynamicMotionSolverFvMesh;

twoDMotion                  no;

// ************************************************************************* //

// solver                      velocityLaplacian;
//
// // diffusivity                 uniform;
// diffusivity                 inverseDistance 1(trackedSurface);
// // diffusivity                 quadratic inversePointDistance 1(trackedSurface);
//
// frozenDiffusion             yes;
//
// // leastSquaresVolPoint        yes;
//
// // nNonOrthogonalCorrectors    6;

// ************************************************************************* //

solver                      laplace;
// solver                      pseudoSolid;

// diffusivity                 uniform;
// diffusivity                 linear;
diffusivity                 quadratic;
distancePatches             1(trackedSurface);

// diffusivity                 deformationEnergy;
// diffusivity                 distortionEnergy;
// diffusivityExponent         10;

frozenDiffusion             yes;

pseudoSolid
{
    poissonsRatio           0.3;
    nCorrectors             3;
    convergenceTolerance    1e-9;
};

// ************************************************************************* //
