tutorials/multiPhysics/interTrackEddyCurrentFoam/rgsSimpleBlock3D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                           none;
}

gradSchemes
{
    default                           none;

    curl(ARe)                         Gauss skewCorrected fluxConservative "nur" "phiGradAnRe";
    curl(AIm)                         Gauss skewCorrected fluxConservative "nur" "phiGradAnIm";

    grad(ARe)                         Gauss skewCorrected fluxConservative "nur" "phiGradAnRe";
    grad(AIm)                         Gauss skewCorrected fluxConservative "nur" "phiGradAnIm";
}

divSchemes
{
    default                           none;
}

laplacianSchemes
{
    default                           none;

    laplacian(nurf,ARe)               jumpGauss harmonic corrected "nur" "phiGradAnRe";
    laplacian(nurf,AIm)               jumpGauss harmonic corrected "nur" "phiGradAnIm";
}

interpolationSchemes
{
    default                           none;

    interpolate(nur)                  harmonic;

    interpolate(ARe)                  skewCorrected fluxConservative "nur" "phiGradAnRe";
    interpolate(AIm)                  skewCorrected fluxConservative "nur" "phiGradAnIm";

    interpolate(grad(ARe))            skewCorrected linear;
    interpolate(grad(AIm))            skewCorrected linear;
}

// ************************************************************************* //
